In [1]:
import pandas as pd
import numpy as np

In [2]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df
# d

   col1  col2
0     1     3
1     2     4

In [3]:
df.dtypes

col1    int64
col2    int64
dtype: object

In [4]:
# df = pd.DataFrame(data=d, dtype=np.int8)
# df

In [5]:
# df1 ={'col3':[6,5,4,7],'col4':pd.series([5,9,8,7],index =[2,3])}

In [6]:
d = {'col3': [0, 1, 2, 3], 'col4': pd.Series([1,2,3,4],index = [0,1,2,3])}
pd.DataFrame(data=d, index=[0, 1, 2, 3])

   col3  col4
0     0     1
1     1     2
2     2     3
3     3     4

In [7]:
#cloumn = Feature
#row = Record

In [8]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [9]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [10]:
df.ndim

2

In [11]:
df.size

4

In [12]:
df.insert(1, "custom_column", ['its_unique', 99])
df

   col1 custom_column  col2
0     1    its_unique     3
1     2            99     4

In [13]:
df.items

<bound method DataFrame.items of    col1 custom_column  col2
0     1    its_unique     3
1     2            99     4>

In [14]:
df.head()

   col1 custom_column  col2
0     1    its_unique     3
1     2            99     4

In [15]:
df.tail()

   col1 custom_column  col2
0     1    its_unique     3
1     2            99     4

In [16]:
df.isin([0, 2])

    col1  custom_column   col2
0  False          False  False
1   True          False  False

In [17]:
# df1.index

In [18]:
# df1.sum()

In [19]:
# df1.nunique()

In [20]:
df

   col1 custom_column  col2
0     1    its_unique     3
1     2            99     4

In [21]:
# df.nunique()

In [22]:
# df1

In [52]:
df1 = pd.DataFrame({'num_legs': [1,1,np.nan], 'num_wings': [1, 3,2]},
                  index=[1, 2,3])
df1

   num_legs  num_wings
1       1.0          1
2       1.0          3
3       NaN          2

In [53]:
df1.isnull()

   num_legs  num_wings
1     False      False
2     False      False
3      True      False

In [ ]:
# sum of values/number of values

In [59]:
legs_mean =df1['num_legs'].mean()
df1.replace(np.nan,legs_mean)

   num_legs  num_wings
1       1.0          1
2       1.0          3
3       1.0          2

In [54]:
df1.dropna()

   num_legs  num_wings
1       1.0          1
2       1.0          3

In [24]:
df1.value_counts()

num_legs  num_wings
1         1            1
          3            1
dtype: int64

In [25]:
df.value_counts()

col1  custom_column  col2
1     its_unique     3       1
2     99             4       1
dtype: int64

In [60]:
df2 = pd.DataFrame({'num_legs': [2, 5, 5,0], 'num_wings': [2, 5,5,np.nan]},
                  index=['falcon', 'dog','Hen','Sparrow'])
df2

         num_legs  num_wings
falcon          2        2.0
dog             5        5.0
Hen             5        5.0
Sparrow         0        NaN

In [62]:
df1 = pd.DataFrame({'num_legs': [1, 2,3], 'num_wings': [2, 2,2]},
                  index=[1, 2,3])
df1

   num_legs  num_wings
1         1          2
2         2          2
3         3          2

In [63]:
df2

         num_legs  num_wings
falcon          2        2.0
dog             5        5.0
Hen             5        5.0
Sparrow         0        NaN

In [29]:
df2.value_counts()

num_legs  num_wings
2         2            2
5         5            2
dtype: int64

In [30]:
df2

         num_legs  num_wings
falcon          2          2
dog             5          5
Hen             5          5
Sparrow         2          2

In [31]:
df2.count()

num_legs     4
num_wings    4
dtype: int64

In [35]:
duplicates = df2.drop_duplicates()

In [36]:
duplicates

        num_legs  num_wings
falcon         2          2
dog            5          5

In [37]:
df2

         num_legs  num_wings
falcon          2          2
dog             5          5
Hen             5          5
Sparrow         2          2

In [47]:
df2.isnull()

         num_legs  num_wings
falcon      False      False
dog         False      False
Hen         False      False
Sparrow     False      False